todofuken = {
    "北海道": 5506419,
    "青森県": 1373339,
    "岩手県": 1330147,
    "宮城県": 2348165,
    "秋田県": 1085997,
    "山形県": 1168924,
    "福島県": 2029064,
    "茨城県": 2969770,
    "栃木県": 2007683,
    "群馬県": 2008068,
    "埼玉県": 7194556,
    "千葉県": 6216289,
    "東京都": 13149388,
    "神奈川県": 9048331,
    "新潟県": 2374450,
    "富山県": 1093247,
    "石川県": 1169788,
    "福井県": 806314,
    "山梨県": 863075,
    "長野県": 2152449,
    "岐阜県": 2080773,
    "静岡県": 3765007,
    "愛知県": 7410719,
    "三重県": 1854724,
    "滋賀県": 1410777,
    "京都府": 2636092,
    "大阪府": 8865245,
    "兵庫県": 5588133,
    "奈良県": 1400728,
    "和歌山県": 1002198,
    "鳥取県": 588557,
    "島根県": 717397,
    "岡山県": 1945276,
    "広島県": 2860750,
    "山口県": 1451338,
    "徳島県": 785491,
    "香川県": 995842,
    "愛媛県": 1431493,
    "高知県": 764456,
    "福岡県": 5071968,
    "佐賀県": 764456,
    "長崎県": 1426779,
    "熊本県": 1817426,
    "大分県": 1196529,
    "宮崎県": 11135233,
    "鹿児島県": 1706242,
    "沖縄県": 1392818
}

STANDARD_POPULATION = 10000000
diff = 120000000        #2つの都道府県の和が日本の総人口を超えることはない
pair = [" " * 2]

def calc(value1, value2):
    sum = value1 + value2
    return abs(STANDARD_POPULATION - sum)

# 47 ** 2程度なら計算量は大したことないので全探索しようと思います。
# 本当はこれの半分の計算量でできるんだけど、まだ実装する力が足りてねえ。頑張れ俺。(e.g. "北海道と沖縄"、"沖縄と北海道"を比較するのは無駄だよね)
for key, value in todofuken.items():
    for key_comp, value_comp in todofuken.items():
        if not key == key_comp:
            ans = calc(value, value_comp)
            if diff > ans:
                diff = ans
                pair[0:1] = key, key_comp   #この書き方Pythonみがあって好き

print(f'2つの県の人口の和が1,000万人に最も近いのは{pair[0]}と{pair[1]}のペアです。\n{pair[0]}の人口は、{todofuken[pair[0]]}人。\n{pair[1]}の人口は、{todofuken[pair[1]]}人。\n合計すると{todofuken[pair[0]] + todofuken[pair[1]]}人。')